Repository: CofficLab/Lumi
Catalog: Plugins/MessageListPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Agent Chat
zh_hans: Agent 聊天
zh_hk: Agent 聊天

source: Agent chat messages and input area
zh_hans: Agent 聊天消息和输入区域
zh_hk: Agent 聊天消息和輸入區域

source: Agent chat messages timeline
zh_hans: Agent 聊天消息时间线
zh_hk: Agent 聊天訊息時間線

source: Agent chat messages timeline in the right ChatSection.
zh_hans: 右侧 ChatSection 中的 Agent 聊天消息时间线。
zh_hk: 右側 ChatSection 中的 Agent 聊天消息時間線。

source: All
zh_hans: 全部
zh_hk: 全部

source: Are you sure you want to delete this message? This action cannot be undone.
zh_hans: 确定要删除这条消息吗？此操作无法撤销。
zh_hk: 確定要刪除這則訊息嗎？此操作無法撤銷。

source: Ask a question, paste context, or describe the task you want Lumi to handle.
zh_hans: 提问、粘贴上下文，或描述你希望 Lumi 处理的任务。
zh_hk: 提問、貼上上下文，或描述你希望 Lumi 處理的任務。

# Build Mode Description
source: Build mode: can execute tools and modify code
zh_hans: 构建模式：可执行工具和修改代码
zh_hk: 構建模式：可執行工具和修改代碼

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Capture screen region as chat attachment
zh_hans: 截取屏幕区域作为聊天附件
zh_hk: 擷取螢幕區域作為聊天附件

source: Chat Attachment
zh_hans: 聊天附件
zh_hk: 聊天附件

source: Chat Input
zh_hans: 聊天输入
zh_hk: 聊天輸入

source: Chat input area with editor, toolbar and model selector
zh_hans: 包含编辑器、工具栏和模型选择器的聊天输入区域
zh_hk: 包含編輯器、工具欄和模型選擇器的聊天輸入區域

source: Chat Messages
zh_hans: 聊天消息
zh_hk: 聊天消息

source: Chat messages area
zh_hans: 聊天消息区域
zh_hk: 聊天消息區域

source: Chat Mode
zh_hans: 聊天模式
zh_hk: 聊天模式

# Chat Mode Description
source: Chat mode: chat only, no actions performed
zh_hans: 对话模式：只聊天，不执行任何操作
zh_hk: 對話模式：只聊天，不執行任何操作

# Chat Mode Hint
source: Switch between chat mode and build mode
zh_hans: 切换对话模式或构建模式
zh_hk: 切換對話模式或構建模式

source: Chat Pending Messages
zh_hans: 聊天待发送消息
zh_hk: 聊天待傳送訊息

source: Chat Submit
zh_hans: 聊天发送
zh_hk: 聊天傳送

source: Chat Toolbar
zh_hans: 聊天工具栏
zh_hk: 聊天工具列

# Chat Toolbar Hint
source: Contains mode, model, attachment and send actions
zh_hans: 包含模式、模型、附件和发送操作
zh_hk: 包含模式、模型、附件和傳送操作

source: Collapse
zh_hans: 折叠
zh_hk: 折疊

source: Collapse message
zh_hans: 折叠消息
zh_hk: 折疊消息

source: Copy
zh_hans: 复制
zh_hk: 複製

source: Current conversation
zh_hans: 当前会话
zh_hk: 目前會話

# Current Provider
source: Current
zh_hans: 当前
zh_hk: 目前

source: Delete
zh_hans: 删除
zh_hk: 刪除

source: Delete Message
zh_hans: 删除消息
zh_hk: 刪除訊息

source: Drag to select a screenshot region. Press ESC to cancel.
zh_hans: 拖拽选择截图区域，按 ESC 取消。
zh_hk: 拖拽選擇截圖區域，按 ESC 取消。

source: Empty state page
zh_hans: 空状态页面
zh_hk: 空狀態頁面

# Example Error Log
source: · Help me explain this error log
zh_hans: · 帮我解释这段错误日志
zh_hk: · 幫我解釋這段錯誤日誌

# Example Test Plan
source: · Help me design a test plan for this project
zh_hans: · 帮我为这个项目设计一个测试计划
zh_hk: · 幫我為這個項目設計一個測試計劃

# Expand Earlier Loaded Messages (%lld)
source: Show earlier loaded messages (%lld)
zh_hans: 显示更早已加载消息（%lld 条）
zh_hk: 顯示更早已載入訊息（%lld 條）

# Expand Earlier Messages
source: Show earlier messages
zh_hans: 显示更早消息
zh_hk: 顯示更早訊息

# Expand Earlier Messages Hint
source: Expand earlier loaded history messages
zh_hans: 展开更早加载的历史消息
zh_hk: 展開更早載入的歷史訊息

source: Fast
zh_hans: 较快
zh_hk: 較快

source: For example:
zh_hans: 例如：
zh_hk: 例如：

source: Frequent
zh_hans: 常用
zh_hk: 常用

source: Hide Raw Message
zh_hans: 隐藏原始消息
zh_hk: 隱藏原始訊息

source: Image
zh_hans: 图片
zh_hk: 圖片

source: Input Area
zh_hans: 输入区域
zh_hk: 輸入區域

# Input Token Help
source: Input Tokens represent the number of tokens sent to the model
zh_hans: 输入 Token 表示发送给模型的 token 数量
zh_hk: 輸入 Token 表示傳送給模型的 token 數量

source: Load earlier messages
zh_hans: 加载更早的消息
zh_hk: 載入更早的訊息

# Load Earlier Messages Hint
source: Continue loading earlier messages from history
zh_hans: 从历史记录中继续加载更早的消息
zh_hk: 從歷史記錄中繼續載入更早的訊息

# Load More Messages (%lld of %lld)
source: Load earlier messages (%lld loaded, %lld total)
zh_hans: 加载更早消息（已加载 %lld 条，共 %lld 条）
zh_hk: 載入更早訊息（已載入 %lld 條，共 %lld 條）

# Loading History
source: Loading history messages…
zh_hans: 正在加载历史消息…
zh_hk: 正在載入歷史訊息…

# Loading More Messages
source: Loading...
zh_hans: 加载中...
zh_hk: 載入中...

source: Message Input
zh_hans: 消息输入框
zh_hk: 訊息輸入框

# Message Input Hint
source: Enter a question or command, press Command + Return to send, Shift + Return for new line
zh_hans: 输入问题或命令，按 Command + 回车发送，Shift + 回车换行
zh_hk: 輸入問題或命令，按 Command + Enter 傳送，Shift + Enter 換行

source: Message list
zh_hans: 消息列表
zh_hk: 訊息列表

# Message List Hint
source: Displays conversation messages in chronological order
zh_hans: 按时间顺序展示会话消息
zh_hk: 按時間順序展示會話訊息

source: Model Selector
zh_hans: 模型选择器
zh_hk: 模型選擇器

source: New Conversation
zh_hans: 新建对话
zh_hk: 新建對話

# New Conversation Hint
source: Create a new conversation
zh_hans: 创建一个新的会话
zh_hk: 建立一個新的會話

source: No conversations
zh_hans: 暂无对话
zh_hk: 暫無對話

source: No Fast Models
zh_hans: 暂无较快模型
zh_hk: 暫無較快模型

# No Fast Models Description
source: Models with higher TPS will appear here
zh_hans: TPS 较高的模型会显示在这里
zh_hk: TPS 較高的模型會顯示在這裡

source: No Frequent Models
zh_hans: 暂无常用模型
zh_hk: 暫無常用模型

# No Frequent Models Description
source: Your frequently used models will appear here
zh_hans: 你常用的模型会显示在这里
zh_hk: 你常用的模型會顯示在這裡

source: No Matching Models
zh_hans: 没有匹配的模型
zh_hk: 沒有匹配的模型

source: No messages
zh_hans: 暂无消息
zh_hk: 暫無訊息

# No Messages Description
source: Enter your question in the input box below to start chatting with the AI assistant
zh_hans: 在下方输入框中输入您的问题，开始与 AI 助手对话
zh_hk: 在下方輸入框中輸入您的問題，開始與 AI 助手對話

source: No messages yet
zh_hans: 暂无消息
zh_hk: 暫無訊息

source: No model selected
zh_hans: 未选择模型
zh_hk: 未選擇模型

source: No provider selected
zh_hans: 未选择供应商
zh_hk: 未選擇供應商

source: No providers
zh_hans: 暂无供应商
zh_hk: 暫無供應商

source: OK
zh_hans: 确定
zh_hk: 確定

# Onboarding Guide
source: View Onboarding Guide
zh_hans: 入门指南
zh_hk: 入門指南

# Onboarding Guide Hint
source: Open the first-time usage guide
zh_hans: 查看 Lumi 的使用指南
zh_hk: 查看 Lumi 的使用指南

source: Open System Settings
zh_hans: 打开系统设置
zh_hk: 打開系統設定

source: Other
zh_hans: 其他
zh_hk: 其他

# Output Token Help
source: Output Tokens represent the number of tokens generated by the model
zh_hans: 输出 Token 表示模型生成的 token 数量
zh_hk: 輸出 Token 表示模型生成的 token 數量

source: Pending chat attachments and sidebar drop handling
zh_hans: 待发送聊天附件和侧栏拖放处理
zh_hk: 待傳送聊天附件和側欄拖放處理

source: Please create or select a conversation first
zh_hans: 请先创建或选择对话
zh_hk: 請先建立或選擇對話

source: Preparing screenshot
zh_hans: 正在准备截图
zh_hk: 正在準備截圖

source: Providers
zh_hans: 供应商
zh_hk: 供應商

# Release to add image to chat
source: Release to add image to the chat
zh_hans: 松开即可将图片添加到聊天
zh_hk: 鬆開即可將圖片加入聊天

# Remove Message
source: Remove this message
zh_hans: 移除此消息
zh_hk: 移除此訊息

source: Resend
zh_hans: 重新发送
zh_hk: 重新發送

source: Response Time
zh_hans: 响应时间
zh_hk: 響應時間

# Response Time Help
source: Response time represents the time from the first token to the completion of the response
zh_hans: 响应时间表示从第一个 token 到响应完成的时间
zh_hk: 響應時間表示從第一個 token 到響應完成的時間

# Screen Recording Permission Required
source: Screen recording permission is required
zh_hans: 需要屏幕录制权限
zh_hk: 需要螢幕錄製權限

# Screen Recording Permission Required Hint
source: Enable Lumi in System Settings > Privacy & Security > Screen Recording, then try again.
zh_hans: 请在“系统设置 > 隐私与安全性 > 屏幕录制”中允许 Lumi，然后重试。
zh_hk: 請在「系統設定 > 私隱與安全性 > 螢幕錄製」中允許 Lumi，然後重試。

source: Screenshot
zh_hans: 截图
zh_hk: 截圖

source: Screenshot failed
zh_hans: 截图失败
zh_hk: 截圖失敗

# Screenshot Failed Generic
source: Lumi could not capture the screen. Try again, or check Screen Recording permission in System Settings.
zh_hans: Lumi 无法捕获屏幕。请重试，或在系统设置中检查屏幕录制权限。
zh_hk: Lumi 無法擷取螢幕。請重試，或在系統設定中檢查螢幕錄製權限。

# Screenshot Failed No Image
source: The system did not return screenshot data. Try again.
zh_hans: 系统没有返回截图数据，请重试。
zh_hk: 系統沒有返回截圖資料，請重試。

# Screenshot Failed No Screens
source: No active screen was found.
zh_hans: 没有找到可用屏幕。
zh_hk: 沒有找到可用螢幕。

source: Screenshot region
zh_hans: 区域截图
zh_hk: 區域截圖

# Screenshot Region Hint
source: Select a screen region as an image attachment
zh_hans: 选择屏幕区域作为图片附件
zh_hk: 選擇螢幕區域作為圖片附件

source: Search Models
zh_hans: 搜索模型
zh_hk: 搜尋模型

# Select Conversation
source: Type text to start chatting
zh_hans: 输入文字开始聊天
zh_hk: 輸入文字開始聊天

source: Select LLM provider and model
zh_hans: 选择 LLM 供应商和模型
zh_hk: 選擇 LLM 供應商和模型

source: Select Model
zh_hans: 选择模型
zh_hk: 選擇模型

# Select Model Hint
source: Open model selector
zh_hans: 打开模型选择器
zh_hk: 打開模型選擇器

# Select or Create Conversation
source: Select an existing conversation from the left list, or create a new one
zh_hans: 从左侧列表选择一个现有会话，或创建新会话
zh_hk: 從左側列表選擇一個現有會話，或創建新會話

source: Select or start a conversation
zh_hans: 选择或开始一个对话
zh_hk: 選擇或開始一個對話

source: Send message
zh_hans: 发送消息
zh_hk: 傳送訊息

# Send Message Hint
source: Send current input, shortcut Command + Return
zh_hans: 发送当前输入内容，快捷键 Command + 回车
zh_hk: 傳送目前輸入內容，快捷鍵 Command + Enter

source: Send or stop chat messages
zh_hans: 发送或停止聊天消息
zh_hk: 傳送或停止聊天訊息

source: Show queued chat messages above the input area
zh_hans: 在输入区上方显示排队中的聊天消息
zh_hk: 在輸入區上方顯示排隊中的聊天訊息

source: Show Raw Message
zh_hans: 显示原始消息
zh_hk: 顯示原始訊息

source: Show Rendered
zh_hans: 显示渲染内容
zh_hk: 顯示渲染內容

source: Show Source
zh_hans: 显示源代码
zh_hk: 顯示原始碼

source: Start a conversation
zh_hans: 开始对话
zh_hk: 開始對話

source: Stop generating
zh_hans: 停止生成
zh_hk: 停止生成

source: Switch between Chat and Build modes
zh_hans: 在聊天和构建模式之间切换
zh_hk: 在聊天和構建模式之間切換

source: Text
zh_hans: 文本
zh_hk: 文本

source: Thinking
zh_hans: 思考中
zh_hk: 思考中

source: Tools
zh_hans: 工具
zh_hk: 工具

# TTFT Help
source: TTFT represents the time from sending the request to receiving the first token
zh_hans: TTFT 表示从发送请求到收到第一个 token 的时间
zh_hk: TTFT 表示從傳送請求到收到第一個 token 的時間

source: Upload image
zh_hans: 上传图片
zh_hk: 上傳圖片

# Upload Image Hint
source: Select local image as attachment
zh_hans: 选择本地图片作为附件
zh_hk: 選擇本地圖片作為附件

source: Use as Draft
zh_hans: 用作草稿
zh_hk: 用作草稿

source: Waiting to send
zh_hans: 等待发送
zh_hk: 等待傳送

source: Explain this concept in simple terms
zh_hans: 用简单的语言解释这个概念
zh_hk: 用簡單的語言解釋這個概念

source: Help me brainstorm ideas
zh_hans: 帮我头脑风暴一些想法
zh_hk: 幫我腦力激盪一些想法

source: Review this paragraph for clarity
zh_hans: 检查这段文字的清晰度
zh_hk: 檢查這段文字的清晰度

source: Scan the project and summarize the architecture
zh_hans: 扫描项目并总结架构
zh_hk: 掃描項目並總結架構

source: Find where authentication is implemented
zh_hans: 查找身份验证的实现位置
zh_hk: 尋找身份驗證的實現位置

source: Suggest a safe refactor plan
zh_hans: 建议一个安全的重构方案
zh_hk: 建議一個安全的重構方案

source: Investigate this bug and propose a fix
zh_hans: 调查这个错误并提出修复方案
zh_hk: 調查這個錯誤並提出修復方案

source: Implement the feature described below
zh_hans: 实现下面描述的功能
zh_hk: 實現下面描述的功能

source: Run the necessary tools and report back
zh_hans: 运行必要的工具并报告结果
zh_hk: 執行必要的工具並回報結果

source: System
zh_hans: 系统
zh_hk: 系統

source: You
zh_hans: 你
zh_hk: 你

source: Assistant
zh_hans: 助手
zh_hk: 助手

source: Tool
zh_hans: 工具
zh_hk: 工具

source: Error
zh_hans: 错误
zh_hk: 錯誤

source: Status
zh_hans: 状态
zh_hk: 狀態
